## Data Filtering: Customers Who Never Order

In [ ]:
Table: Customers

+-------------+---------+
| Column Name | Type    |
+-------------+---------+
| id          | int     |
| name        | varchar |
+-------------+---------+
id is the primary key (column with unique values) for this table.
Each row of this table indicates the ID and name of a customer.
 

Table: Orders

+-------------+------+
| Column Name | Type |
+-------------+------+
| id          | int  |
| customerId  | int  |
+-------------+------+
id is the primary key (column with unique values) for this table.
customerId is a foreign key (reference columns) of the ID from the Customers table.
Each row of this table indicates the ID of an order and the ID of the customer who ordered it.
 

Write a solution to find all customers who never order anything.

Return the result table in any order.

The result format is in the following example.

 

Example 1:

Input: 
Customers table:
+----+-------+
| id | name  |
+----+-------+
| 1  | Joe   |
| 2  | Henry |
| 3  | Sam   |
| 4  | Max   |
+----+-------+
Orders table:
+----+------------+
| id | customerId |
+----+------------+
| 1  | 3          |
| 2  | 1          |
+----+------------+
Output: 
+-----------+
| Customers |
+-----------+
| Henry     |
| Max       |
+-----------+

In [1]:
import pandas as pd

In [24]:
customer_table = pd.DataFrame({'id':[1, 2, 3, 4], 'name': ['Joe', 'Henry', 'Sam', 'Max']})

In [25]:
order_table = pd.DataFrame({'id': [1,2], 'customerId': [3, 1]})

In [36]:
customer_table.set_index('id', inplace=True)

In [37]:
customer_table

     name
id
1     Joe
2   Henry
3     Sam
4     Max

In [27]:
order_table.drop('id', axis=1, inplace=True)

In [31]:
order_table

   customerId
0           3
1           1

In [34]:
order_table.set_index('customerId', inplace=True)

In [44]:
new_table = order_table.join(customer_table)

In [48]:
new_table.rename(columns={'name': 'customer name'}, inplace=True)

In [50]:
customer_table = customer_table.join(new_table)

In [51]:
customer_table

     name customer name
id
1     Joe           Joe
2   Henry           NaN
3     Sam           Sam
4     Max           NaN

In [70]:
customer_table[customer_table['customer name'].isnull()][['name']]

     name
id
2   Henry
4     Max

# Better Solution

In [67]:
customers = pd.DataFrame({'id':[1, 2, 3, 4], 'name': ['Joe', 'Henry', 'Sam', 'Max']})
orders = pd.DataFrame({'id': [1,2], 'customerId': [3, 1]})

In [68]:

filtered_customers = customers[~customers['id'].isin(orders['customerId'])]
filtered_customers = filtered_customers[['name']].rename(columns={'name': 'Customers'})

In [69]:
filtered_customers

  Customers
1     Henry
3       Max